CREATE TABLE StudentsGrades (
    id SERIAL PRIMARY KEY,
    full_name VARCHAR(100),
    city VARCHAR(50),
    country VARCHAR(50),
    date_of_birth DATE,
    email VARCHAR(100),
    phone_number VARCHAR(20),
    group_name VARCHAR(50),
    average_grade FLOAT,
    min_subject VARCHAR(50),
    max_subject VARCHAR(50),
    min_grade FLOAT,
    max_grade FLOAT
);

INSERT INTO StudentsGrades (full_name, city, country, date_of_birth, email, phone_number, group_name, average_grade, min_subject, max_subject, min_grade, max_grade) VALUES
('Ковальчук Марія Вікторівна', 'Одеса', 'Україна', '2000-03-25', 'kovalchuk@gmail.com', '+380991234567', 'Група 3', 88.2, 'Історія', 'Хімія', 75.0, 95.0),
('Григоренко Олексій Васильович', 'Дніпро', 'Україна', '1999-06-12', 'grigorenko@gmail.com', '+380981234567', 'Група 2', 79.8, 'Фізика', 'Математика', 70.0, 85.0),
('Білоус Олександра Ігорівна', 'Запоріжжя', 'Україна', '2001-01-05', 'bilous@gmail.com', '+380961234567', 'Група 1', 91.5, 'Інформатика', 'Біологія', 80.0, 100.0),
('Кузьменко Дмитро Володимирович', 'Херсон', 'Україна', '1998-09-17', 'kuzmenko@gmail.com', '+380921234567', 'Група 3', 83.7, 'Хімія', 'Фізика', 75.0, 90.0),
('Шевченко Наталія Олександрівна', 'Чернігів', 'Україна', '2000-11-30', 'shevchenko@gmail.com', '+380941234567', 'Група 2', 87.1, 'Інформатика', 'Англійська', 80.0, 95.0),
('Мельник Антон Сергійович', 'Кривий Ріг', 'Україна', '1997-07-22', 'melnik@gmail.com', '+380901234567', 'Група 1', 75.6, 'Фізкультура', 'Історія', 70.0, 80.0),
('Павленко Юлія Петрівна', 'Запоріжжя', 'Україна', '1999-04-14', 'pavlenko@gmail.com', '+380931234567', 'Група 3', 89.9, 'Біологія', 'Математика', 85.0, 95.0),
('Ковальов Олексій Ігорович', 'Львів', 'Україна', '1998-08-05', 'kovalov@gmail.com', '+380971234567', 'Група 2', 82.4, 'Англійська', 'Фізика', 75.0, 90.0),
('Марченко Анастасія Олексіївна', 'Київ', 'Україна', '2000-12-28', 'marchenko@gmail.com', '+380951234567', 'Група 1', 93.7, 'Математика', 'Інформатика', 85.0, 100.0),
('Семенов Сергій Миколайович', 'Харків', 'Україна', '1999-02-19', 'semenov@gmail.com', '+380961234567', 'Група 3', 86.3, 'Історія', 'Фізика', 80.0, 95.0),
('Павлюченко Лідія Володимирівна', 'Одеса', 'Україна', '1998-10-10', 'pavliuchenko@gmail.com', '+380971234567', 'Група 2', 80.5, 'Фізика', 'Хімія', 75.0, 85.0),
('Лисенко Іван Олегович', 'Дніпро', 'Україна', '2001-05-03', 'lysenko@gmail.com', '+380981234567', 'Група 1', 88.9, 'Інформатика', 'Біологія', 80.0, 95.0),
('Ткаченко Анна Василівна', 'Херсон', 'Україна', '1999-09-26', 'tkachenko@gmail.com', '+380991234567', 'Група 3', 82.1, 'Біологія', 'Англійська', 75.0, 90.0),
('Олійник Дмитро Олександрович', 'Чернігів', 'Україна', '2000-02-14', 'oliinyk@gmail.com', '+380901234567', 'Група 2', 94.6, 'Історія', 'Математика', 85.0, 100.0),
('Поліщук Оксана Петрівна', 'Кривий Ріг', 'Україна', '1998-11-07', 'polishchuk@gmail.com', '+380931234567', 'Група 1', 81.3, 'Хімія', 'Фізика', 75.0, 85.0);
